export const questions = [
  {
    id: 1,
    question: "Як можна додати власне місце?",
    answer:
      "Тільки авторизовані користувачі можуть додавати свої місця. Ви можете зробити це натиснувши кнопку 'Додати місце' котра з'являється коли ви увійдете в свій акаунт. У формі потрібно заповнити всі поля, обрати категорії, які описують місце та фото в альбомному форматі і натиснути кнопку 'Надіслати'. Після розгляду місце буде додане адміном у нашу базу, або ж буде відхилене якщо це фейкове місце або воно не відповідає своєму розташуванню.",
  },
  {
    id: 2,
    question: "Чому моє місце може бути відхилене адміністратором?",
    answer:
      "Ваше місце може бути відхилене якщо воно не відповідає дійсності, містить невірну інформацію чи невідповідні фотографії. Також якщо в описі містяться нецензурні висловлювання чи образи.",
  },
  {
    id: 3,
    question: "Скільки часу потрібно на обробку мого запиту?",
    answer:
      "Ми не маємо можливості розглядати запити кожного дня. Проте намагатимемось робити це регулярно, оновлюючи список місць раз на 1-2 тижні.",
  },
  {
    id: 4,
    question: "Як віднайти потрібне мені місце?",
    answer:
      "Щоб знайти потрібне вам місце, ви можете скористатися розділом 'Пошук місць'. Пошук можна здійснити за назвою, областю або категоріями.",
  },
  {
    id: 5,
    question: "Для кого призначений цей сайт?",
    answer:
      "Сайт призначений для усіх, хто любить подорожувати Україною. У базі є історичні пам'ятки, музеї, місця для таборів та відпочинку.",
  },
];
