export const questions = [
    {
      question: "Як можна додати власне місце?",
      answer:
        "Ви можете зробити це у розділі 'Додати місце'. Для цього потрібно ввести назву, обрати категорії, які описують місце, додати координати, опис та фото. Натиснувши кнопку 'Надіслати' ми отримаємо запит. Після розгляду місце буде додане у нашу базу, або ж буде відхилене.",
    },
    {
      question: "Скільки часу потрібно на обробку мого запиту?",
      answer:
        "Ми не маємо можливості розглядати запити кожного дня і додавати на сайт лише по одному місцю. Проте намагатимемось робити це регулярно, оновлюючи список місць в гугл картах раз на 1-2 тижні. Оновлення бази на сайті може зайняти довше часу.",
    },
    {
      question: "Як віднайти потрібне мені місце?",
      answer:
        "Щоб знайти потрібне вам місце, ви можете скористатися розділом 'Пошук місць'. Сам пошук можна здійснити за введеною назвою, областю розташування або категоріями. Також ви маєте можливість відсортувати список за потрібним критерієм та обрати вигляд списку або блоків.",
    },
    {
      question: "Для кого призначений цей сайт?",
      answer:
        "Сайт призначений для усіх, хто любить подорожувати Україною. Серед місць, внесених до нашої бази, є історичні пам'ятки, музеї, місця для таборів, відпочинку. Тому сайт може стати в нагоді будь-кому.",
    },
  ];
  