export const questions = [
    {
      question: "Як можна додати власне місце?",
      answer:
        "Тільки авторизовані користувачі можуть додавати свої місця. Ви можете зробити натиснувши кнопку 'Додати місце' котра з'являється коли ви увійдете в свій акаунт. У формі потрібно заповнити всі поля, обрати категорії, які описують місце та фото в альбомному форматі і натиснути кнопку 'Надіслати'. Після розгляду місце буде додане адміном у нашу базу, або ж буде відхилене якщо це фейкове місце або воно не відповідає своєму розташуванню.",
    },
    {
      question: "Чому моє місце може бути відхилене адміністратором?",
      answer:
        "Ваше місце мже бути відхилене якщо воно не відповідає дійсності, містить невірну інформацію чи невідповідні фотографії. Також якщо в описі містяться нецензурні висловлювання чи образи в адресу інших користувачів чи адміністрації сайту.",
    },
    {
      question: "Скільки часу потрібно на обробку мого запиту?",
      answer:
        "Ми не маємо можливості розглядати запити кожного дня і додавати на сайт лише по одному місцю. Проте намагатимемось робити це регулярно, оновлюючи список місць в гугл картах раз на 1-2 тижні. Оновлення бази на сайті може зайняти довше часу.",
    },
    {
      question: "Як віднайти потрібне мені місце?",
      answer:
        "Щоб знайти потрібне вам місце, ви можете скористатися розділом 'Пошук місць'. Сам пошук можна здійснити за введеною назвою, областю розташування або категоріями. Також ви маєте можливість відсортувати список за потрібним критерієм та обрати вигляд списку або блоків.",
    },
    {
      question: "Для кого призначений цей сайт?",
      answer:
        "Сайт призначений для усіх, хто любить подорожувати Україною. Серед місць, внесених до нашої бази, є історичні пам'ятки, музеї, місця для таборів, відпочинку. Тому сайт може стати в нагоді будь-кому.",
    },
  ];
  